<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"ac9e88dc3fe08528b13a34f81ed4b82c7185f75eb6a18207ead8cf2326656505","plan_job_ref":"Job API #1608 at https://github.com/coverage-robot/core/actions/runs/8445133681","plan_out_hash":"034d64f8712fca0aa4d7b0a7b7c5d27b55b386a842d7c22f49f1e6557bae3302","plan_hash":"a35095b2519e0901ee829e97ae8805e6a5f37f92d63dacf14cf3d701e019e08b","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __./services/api/infrastructure__ in the __prod__ workspace
With var files: `./services/api/infrastructure/prod.tfvars`
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.api.aws_lambda_function.api will be updated in-place
!~  resource "aws_lambda_function" "api" {
        id                             = "coverage-api-prod"
!~      last_modified                  = "2024-03-26T23:45:26.000+0000" -> (known after apply)
!~      source_code_hash               = "9OYYcLrrdcVeboaatTy0qOe/FAepJdB4C0Dz8Xf9EgE=" -> "0Ep9OPwrwJJSEcE/rSf19n/Mj7nyq5Zq6KeFUwgb0BI="
        tags                           = {}
#        (20 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # module.event_listener.aws_lambda_function.events will be updated in-place
!~  resource "aws_lambda_function" "events" {
        id                             = "coverage-api-event-listener-prod"
!~      last_modified                  = "2024-03-26T23:45:16.000+0000" -> (known after apply)
!~      source_code_hash               = "9OYYcLrrdcVeboaatTy0qOe/FAepJdB4C0Dz8Xf9EgE=" -> "0Ep9OPwrwJJSEcE/rSf19n/Mj7nyq5Zq6KeFUwgb0BI="
        tags                           = {}
#        (20 unchanged attributes hidden)

#        (4 unchanged blocks hidden)
    }

  # module.webhook_handler.aws_cognito_user_pool_client.cognito_client will be created
+   resource "aws_cognito_user_pool_client" "cognito_client" {
+       access_token_validity                         = (known after apply)
+       allowed_oauth_flows                           = (known after apply)
+       allowed_oauth_flows_user_pool_client          = (known after apply)
+       allowed_oauth_scopes                          = (known after apply)
+       auth_session_validity                         = (known after apply)
+       callback_urls                                 = (known after apply)
+       client_secret                                 = (sensitive value)
+       default_redirect_uri                          = (known after apply)
+       enable_propagate_additional_user_context_data = (known after apply)
+       enable_token_revocation                       = (known after apply)
+       explicit_auth_flows                           = [
+           "ALLOW_ADMIN_USER_PASSWORD_AUTH",
+           "ALLOW_REFRESH_TOKEN_AUTH",
        ]
+       generate_secret                               = true
+       id                                            = (known after apply)
+       id_token_validity                             = (known after apply)
+       logout_urls                                   = (known after apply)
+       name                                          = "coverage-api-webhook-handler-prod"
+       prevent_user_existence_errors                 = (known after apply)
+       read_attributes                               = (known after apply)
+       refresh_token_validity                        = (known after apply)
+       supported_identity_providers                  = (known after apply)
+       user_pool_id                                  = "*******************"
+       write_attributes                              = (known after apply)
    }

  # module.webhook_handler.aws_lambda_function.webhooks will be updated in-place
!~  resource "aws_lambda_function" "webhooks" {
        id                             = "coverage-api-webhook-handler-prod"
!~      last_modified                  = "2024-03-26T23:45:04.000+0000" -> (known after apply)
!~      source_code_hash               = "9OYYcLrrdcVeboaatTy0qOe/FAepJdB4C0Dz8Xf9EgE=" -> "0Ep9OPwrwJJSEcE/rSf19n/Mj7nyq5Zq6KeFUwgb0BI="
        tags                           = {}
#        (20 unchanged attributes hidden)

!~      environment {
!~          variables = {
-               "AWS_ACCOUNT_ID"    = "************"
-               "BREF_PING_DISABLE" = "1"
            } -> (known after apply)
        }

#        (3 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [API #1608](https://github.com/coverage-robot/core/actions/runs/8445133681)